Config/Documents/СписаниеВосстановлениеЗадолженностиПоДоходам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СписаниеВосстановлениеЗадолженностиПоДоходам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИсполнениеДоговоровСПокупателями</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСоСтудентами</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСоСтудентамиДопУслуги</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСписанияЗадолженностиПоДоходам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияРасчетовСКонтрагентами</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеВосстановлениеЗадолженностиПоДоходам</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризационнаяОписьРасчетовПоПоступлениям</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризационнаяОписьРасчетовСКонтрагентами</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияРасчетовПоПоступлениям</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокументаФизЛиц</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПостоянноДействующиеКомиссии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЛокальногоАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЛокальногоАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЛокальногоАкта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьПоРасчетамСоСтудентами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокКонтрагентов</Name>
					<Comment>Контрагенты, по которым производится отбор при заполнении по данным учета.</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПлательщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>22</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Задолженность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопСубконтоРасчетов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокСуммаВал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписатьСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписатьСуммаВал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСписания</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезолюцияКомиссии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РезолюцияКомиссии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СлучайСписанияВосстановленияЗадолженности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СлучаиСписанияВосстановленияЗадолженностиПоДоходам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МерыПоВзысканиюЗадолженности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МерыПоВзысканиюЗадолженности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОбразованияЗадолженности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРеестровойЗаписи</Name>
							<Comment>Уникальный номер реестровой записи источника дохода бюджета</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Студент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факультет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачислениеЗаУслугу</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НачисленияСтудентамЗаПрочиеУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеВозникновенияЗадолженности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеВозникновенияЗадолженностиНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеВозникновенияЗадолженностиДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеПризнанияСомнительнойЗадолженности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеПризнанияСомнительнойЗадолженностиНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеПризнанияСомнительнойЗадолженностиДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодФормыБухгалтерскойОтчетности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтсутствия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отсутствует</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/ВидыОперацийСписанияЗадолженностиПоДоходам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСписанияЗадолженностиПоДоходам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СписаниеСомнительнойЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеСомнительнойЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБезнадежнойКВзысканиюЗадолженности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/СписаниеВосстановлениеЗадолженностиПоДоходам/Forms/ФормаГрупповогоИзмененияРеквизитов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НачальныеЗначения") И Параметры.Свойство("ВидОперации") Тогда
		
		НачальныеЗначения = Параметры.НачальныеЗначения;
		ЗаполнитьСтрокиТаблицы(НачальныеЗначения, Параметры.ВидОперации);
		
		ЗначениеСвойства = Неопределено;
		Для каждого СтрокаТаблицы Из ТаблицаРеквизитов Цикл
			Если НачальныеЗначения.Свойство(СтрокаТаблицы.ИмяРеквизита, ЗначениеСвойства) Тогда
				СтрокаТаблицы.ЗначениеРеквизита = ЗначениеСвойства;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если Параметры.Свойство("СписокВыбораКодФормыБухОтчетности") Тогда
		КодыФормБухОтчетности = Параметры.СписокВыбораКодФормыБухОтчетности;
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоВВыделенныхСтроках") И Параметры.ТолькоВВыделенныхСтроках Тогда
		Заголовок = НСтр("ru='Изменить реквизиты в выделенных строках'");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТаблицаРеквизитов", "Подсказка",
			НСтр("ru='В выделенных строках документа будут установлены значения реквизитов, которые отмечены флажком.'"));
	Иначе
		Заголовок = НСтр("ru='Изменить реквизиты во всех строках'");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТаблицаРеквизитов", "Подсказка",
			НСтр("ru='Во всех строках документа будут установлены значения реквизитов, которые отмечены флажком.'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблицаРеквизитов

&НаКлиенте
Процедура ТаблицаРеквизитовЗначениеРеквизитаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
	ТекущиеДанные.ИзменятьРеквизит = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовЗначениеРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
	Если ТекущиеДанные.ИмяРеквизита = "КодФормыБухгалтерскойОтчетности" Тогда
		СтандартнаяОбработка = Ложь;
		Оповещение = Новый ОписаниеОповещения("ЗначениеРеквизитаПослеВыбора", ЭтотОбъект);
		ПоказатьВыборИзСписка(Оповещение, КодыФормБухОтчетности, Элемент, );
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРеквизитаПослеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.ИзменятьРеквизит = Истина;
		
		Если Результат <> Неопределено Тогда
			Если ТекущиеДанные.ИмяРеквизита = "КодФормыБухгалтерскойОтчетности" Тогда
				ТекущиеДанные.ЗначениеРеквизита = СокрЛП(Результат.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ВозвращаемоеЗначение = Новый Структура;
	Для каждого СтрокаТаблицы Из ТаблицаРеквизитов Цикл
	
		Если СтрокаТаблицы.ИзменятьРеквизит Тогда
			ВозвращаемоеЗначение.Вставить(СтрокаТаблицы.ИмяРеквизита, СтрокаТаблицы.ЗначениеРеквизита);
		КонецЕсли;
	
	КонецЦикла;
	ОповеститьОВыборе(ВозвращаемоеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСтрокиТаблицы(НачальныеЗначения, ВидОперации)

	ЭтоСписаниеБезнадежнойКВзысканиюЗадолженности = (ВидОперации = ПредопределенноеЗначение(
		"Перечисление.ВидыОперацийСписанияЗадолженностиПоДоходам.СписаниеБезнадежнойКВзысканиюЗадолженности"));
	
	Если НачальныеЗначения.Свойство("СлучайСписанияВосстановленияЗадолженности") Тогда
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита = "СлучайСписанияВосстановленияЗадолженности";
		НоваяСтрока.ПредставлениеРеквизита = "Случай списания (восстановления) задолженности";
		НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.СлучаиСписанияВосстановленияЗадолженностиПоДоходам");
	КонецЕсли;
	
	Если ЭтоСписаниеБезнадежнойКВзысканиюЗадолженности
		И НачальныеЗначения.Свойство("МерыПоВзысканиюЗадолженности") Тогда
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита = "МерыПоВзысканиюЗадолженности";
		НоваяСтрока.ПредставлениеРеквизита = "Меры по взысканию задолженности";
		НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.МерыПоВзысканиюЗадолженности");
	КонецЕсли;
	
	Если ЭтоСписаниеБезнадежнойКВзысканиюЗадолженности
		И НачальныеЗначения.Свойство("КодФормыБухгалтерскойОтчетности") Тогда
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита = "КодФормыБухгалтерскойОтчетности";
		НоваяСтрока.ПредставлениеРеквизита = "Код формы бухгалтерской (бюджетной) отчетности";
		НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("Строка");
	КонецЕсли;
	
	// Основание возникновения задолженности (документ, номер, дата).
	Если НачальныеЗначения.Свойство("ОснованиеВозникновенияЗадолженности") Тогда
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита = "ОснованиеВозникновенияЗадолженности";
		НоваяСтрока.ПредставлениеРеквизита = "Документ-основание возникновения задолженности";
		НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("Строка");
	КонецЕсли;
	
	Если НачальныеЗначения.Свойство("ОснованиеВозникновенияЗадолженностиНомер") Тогда
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита = "ОснованиеВозникновенияЗадолженностиНомер";
		НоваяСтрока.ПредставлениеРеквизита = "Документ-основание возникновения задолженности, номер";
		НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("Строка");
	КонецЕсли;
	
	Если НачальныеЗначения.Свойство("ОснованиеВозникновенияЗадолженностиДата") Тогда
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита = "ОснованиеВозникновенияЗадолженностиДата";
		НоваяСтрока.ПредставлениеРеквизита = "Документ-основание возникновения задолженности, дата";
		НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата));
	КонецЕсли;
	
	// Основание признания (восстановления) сомнительной задолженности (документ, номер, дата).
	Если НЕ ЭтоСписаниеБезнадежнойКВзысканиюЗадолженности
		И НачальныеЗначения.Свойство("ОснованиеПризнанияСомнительнойЗадолженности") Тогда
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита = "ОснованиеПризнанияСомнительнойЗадолженности";
		НоваяСтрока.ПредставлениеРеквизита = "Документ-основание признания (восстановления) сомнительной задолженности";
		НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("Строка");
	КонецЕсли;
	
	Если НЕ ЭтоСписаниеБезнадежнойКВзысканиюЗадолженности
		И НачальныеЗначения.Свойство("ОснованиеПризнанияСомнительнойЗадолженностиНомер") Тогда
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита = "ОснованиеПризнанияСомнительнойЗадолженностиНомер";
		НоваяСтрока.ПредставлениеРеквизита = "Документ-основание признания (восстановления) сомнительной задолженности, номер";
		НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("Строка");
	КонецЕсли;
	
	Если НЕ ЭтоСписаниеБезнадежнойКВзысканиюЗадолженности
		И НачальныеЗначения.Свойство("ОснованиеПризнанияСомнительнойЗадолженностиДата") Тогда
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита = "ОснованиеПризнанияСомнительнойЗадолженностиДата";
		НоваяСтрока.ПредставлениеРеквизита = "Документ-основание признания (восстановления) сомнительной задолженности, дата";
		НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
